podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/RTC_MK10F12.svd.xml
            <register>
               <name>MER</name>
               <description>Monotonic Enable Register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>MCE</name>
                     <description>Monotonic Counter Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the monotonic counter load the counter with the value written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the monotonic counter increment the counter</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCLR</name>
               <description>Monotonic Counter Low Register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>MCL</name>
                     <description>Monotonic Counter Low</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCHR</name>
               <description>Monotonic Counter High Register</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>MCH</name>
                     <description>Monotonic Counter High</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAR</name>
               <description>Write Access Register\n
Protects register against writes.  Any writes are ignored</description>
               <addressOffset>0x800</addressOffset>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>TSRW</name>
                     <description>Time Seconds Register Write Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes OK</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TSRW" > <name>TPRW</name> <description>Time Prescaler Register Write Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>TARW</name> <description>Time Alarm Register Write Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>TCRW</name> <description>Time Compensation Register Write Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>CRW</name> <description>Control Register Write Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>SRW</name> <description>Status Register Write Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>LRW</name> <description>Lock Register Write Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>IERW</name> <description>Interrupt Enable Register Write Enable</description> <bitOffset>7</bitOffset> </field>
                  <field>
                     <name>TTSW</name>
                     <description>Tamper Time Seconds Write</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Tamper Time Seconds Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Tamper Time Seconds Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MERW</name>
                     <description>Monotonic Enable Register Write</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Monotonic Enable Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Monotonic Enable Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MCLW</name>
                     <description>Monotonic Counter Low Write</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Monotonic Counter Low Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Monotonic Counter Low Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MCHW</name>
                     <description>Monotonic Counter High Write</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Monotonic Counter High Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Monotonic Counter High Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RAR</name>
               <description>Read Access Register\n
Protects register against reads.  Any reads are ignored</description>
               <addressOffset>0x804</addressOffset>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>TSRR</name>
                     <description>Time Seconds Register Read Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Reads ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reads OK</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TSRR" > <name>TPRR</name> <description>Time Prescaler Register Read Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>TARR</name> <description>Time Alarm Register Read Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>TCRR</name> <description>Time Compensation Register Read Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>CRR</name> <description>Control Register Read Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>SRR</name> <description>Status Register Read Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>LRR</name> <description>Lock Register Read Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>IERR</name> <description>Interrupt Enable Register Read Enable</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>TTSR</name> <description>Tamper Time Seconds Read</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>MERR</name> <description>Monotonic Enable Register Read</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>MCLR</name> <description>Monotonic Counter Low Read</description> <bitOffset>10</bitOffset> </field>
                  <field>
                     <name>MCHR</name>
                     <description>Monotonic Counter High Read</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Reads from the Monotonic Counter High Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reads from the Monotonic Counter High Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
